Repository: Amebis/Updater
Catalog: Updater/locale/*.po
Languages: ru_ru, sl_si

source: Update check complete. Your product is up to date.
ru_ru: Проверка на наличие обновлений завершена. У вас последняя версия программы.
sl_si: Preverjanje posodobitev končano. Nameščena je najnovejša različica.

source: Downloading repository catalogue...
ru_ru: Загрузка каталога репозитория ...
sl_si: Prenos repozitorijevega kataloga ...

source: Contacting repository at %s...
ru_ru: Контактирование репозитория при %s ...
sl_si: Dostop do repozitorija na %s ...

source: Error resolving %s server name.
ru_ru: Ошибка при разрешении имени сервера %s.
sl_si: Napaka pri ugotavljanju naslova strežnika %s.

source: Repository did not change since the last time.
ru_ru: Репозиторий не от последней проверки изменился.
sl_si: Repozitorij se od zadnjič ni spremenil.

source: %u status received from server %s (port %u) requesting %s.
sl_si: Prejet status %u s strežnika %s (vrata %u) pri zahtevi za %s.

source: Error response received from server %s (port %u) requesting %s.
ru_ru: От сервера %s (порт %u) получен ошибочный ответ при запросе %s.
sl_si: Prejet odgovor o napaki s strežnika %s (vrata %u) pri zahtevi za %s.

source: Can not open/create %s file for writing.
ru_ru: Открытие/создание файла %s для записи невозможно.
sl_si: Ne morem odpreti/ustvariti datoteke %s za pisanje.

source: Can not write to %s file.
ru_ru: Запись в файл %s невозможен.
sl_si: Ne morem pisati v datoteko %s.

source: Error loading repository catalogue.
ru_ru: Ошибка при загрузке каталога репозитория.
sl_si: Napaka pri nalaganju repozitorijevega kataloga.

source: Verifying repository catalogue signature...
ru_ru: Проверка подписи каталога репозитория ...
sl_si: Preverjanje podpisa repozitorijevega kataloga ...

source: Signature not found in the repository catalogue.
ru_ru: Подпись в каталоге репозитория не найдена.
sl_si: V repozitorijevem katalogu ni podpisa.

source: Repository catalogue signature does not match its content, or signature verification failed.
ru_ru: Подпись каталога репозитория, или не соответствует его содержанию или проверка подписи завершилась ошибкой.
sl_si: Podpis repozitorijevega kataloga ne ustreza njegovi vsebini, oziroma preverjanje podpisa ni uspelo.

source: Invalid root element in repository catalogue (actual: %s, expected: %s).
ru_ru: Недействительный корневой элемент в каталоге репозитория (фактический: %s, ожидаемый: %s).
sl_si: Napačen korenski element v repozitorijevem katalogu (dejanski: %s, pričakovan: %s).

source: Parsing repository catalogue...
ru_ru: Анализ каталога репозитория ...
sl_si: Razčlemba repozitorijevega kataloga ...

source: Update package found (version: %s).
ru_ru: Найден пакет обновления (версия: %s).
sl_si: Posodobitveni paket najden (verzija: %s).

source: Reading update package meta-information from cache failed or incomplete.
ru_ru: Чтение метаданных пакета обновления в кэше завершилась ошибкой, или чтение не завершилось.
sl_si: Branje meta-informacij posodobitvenega paketa iz predpomnilnika ni uspelo ali ni bilo celotno.

source: Update package file already downloaded and ready to install.
ru_ru: Файл пакета обновления уже загружен и готов к установке.
sl_si: Posodobitveni paket je že prenesen in pripravljen na namestitev.

source: Downloading update package %s...
ru_ru: Загрузка пакета обновления %s ...
sl_si: Prenos posodobitvenega paketa %s ...

source: Error response received.
ru_ru: Получен ошибочный ответ.
sl_si: Prejet odgovor o napaki.

source: Update package downloaded and ready to install.
ru_ru: Пакет обновления загружен и готов к установке.
sl_si: Posodobitveni paket je prenesen in pripravljen na namestitev.

source: Update package file corrupt.
ru_ru: Файл пакета обновления испорчен.
sl_si: Posodobitveni paket je pokvarjen.

source: Launching update...
ru_ru: Запуск обновления ...
sl_si: Zagon posodobitve ...

source: msiexec.exe launch succeeded. For detailed information, see %s file.
ru_ru: Запуск msiexec.exe успешно выполнен. Для получения подробной информации см. файл %s.
sl_si: Zagon msiexec.exe je uspel. Za podrobnejše informacije glejte datoteko %s.

source: msiexec.exe launch failed. ShellExecute returned %i.
ru_ru: Запуск msiexec.exe завершился ошибкой. ShellExecute возвратил %i.
sl_si: Zagon msiexec.exe ni uspel. ShellExecute je vrnil %i.
